import pandas as pd
bindustry = {
    1: "숙박",
    2: "오프라인 유통",
    3: "F&B",
    4: "가전가구",
    5: "패션잡화",
    6: "문화여가",
    7: "생활서비스"
}
bizdic = {
    "숙박": ['숙박'],
    "오프라인 유통": ['백화점', '마트', '편의점', '면세점', '소매점', '식료품'],
    "F&B": ['한식', '양식', '일식', '중식', '부페', '일반대중음식', '카페베이커리', '패스트푸드', '유흥주점'],
    "가전가구": ['가전', '인테리어', '가구', '문구기타'],
    "패션잡화": ['성인의류', '아동캐쥬얼', '스포츠용품', '침구직물', '잡화', '주얼리', '안경', '화장품', '기타잡화'],
    "문화여가": ['극장공연', '스포츠', '오락', '미술', '음악', '서점'],
    "생활서비스": ['미용건강', '의료', '교육', '주유', '자동차', '애완동물', '생활기타']
}
# 업종 중분류 코드와 한글 업종명 매핑
industry = {
    11: '숙박',
    21: '백화점',
    22: '마트',
    23: '편의점',
    24: '면세점',
    25: '소매점',
    26: '식료품',
    31: '한식',
    32: '양식',
    33: '일식',
    34: '중식',
    35: '부페',
    36: '일반대중음식',
    37: '카페베이커리',
    38: '패스트푸드',
    39: '유흥주점',
    41: '가전',
    42: '인테리어',
    43: '가구',
    44: '문구기타',
    51: '성인의류',
    52: '아동캐쥬얼',
    53: '스포츠용품',
    54: '침구직물',
    55: '잡화',
    56: '주얼리',
    57: '안경',
    58: '화장품',
    59: '기타잡화',
    61: '극장공연',
    62: '스포츠',
    63: '오락',
    64: '미술',
    65: '음악',
    66: '서점',
    71: '미용건강',
    72: '의료',
    73: '교육',
    74: '주유',
    75: '자동차',
    76: '애완동물',
    77: '생활기타'
}

major_list = [str(industry[i]) for i in industry]


df = pd.read_excel('./modules/행정동_코드.xlsx').loc[:, ['시도명', '시군구명', '읍면동명']]
gcds = df.loc[:, '시도명'].unique()
sggs = {k: list(v) for k, v in df.groupby('시도명')[
    '시군구명'].unique().to_dict().items()}
emds = {k: list(v) for k, v in df.groupby('시군구명')[
    '읍면동명'].unique().to_dict().items()}
if __name__ == "__main__":
    pass
